app/views/authors/articles.html.erb

<% unless @author.articles.empty? %>
---
SELECT  1 AS one FROM "articles" WHERE "articles"."author_id" = ? LIMIT 1  [["author_id", 3]]
SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 3]]