app/views/authors/show.html.erb

  <strong>Articles:</strong>
  <% @author.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [[nil, 1]]