app/controllers/admin_articles_controller.rb

  def index
    @admin_articles = Article.all
---
SELECT "articles".* FROM "articles"