app/controllers/admin_authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @admin_authors = Author.all