app/controllers/articles_controller.rb

INSERT INTO "articles" ("author_id", "article_header", "article_name", "article_picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", 1], ["article_header", "konu"], ["article_name", "içerik"], ["article_picture", "resim"], ["created_at", "2015-07-23 13:17:09.862116"], ["updated_at", "2015-07-23 13:17:09.862116"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save