app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
---
  def articles
    @author = Author.find(params[:author_id])

INSERT INTO "authors" ("name", "surname", "taskID", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Alper "], ["surname", "Karapınar"], ["taskID", 1], ["picture", ""], ["created_at", "2015-07-23 10:39:14.909231"], ["updated_at", "2015-07-23 10:39:14.909231"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]
---
  def destroy
    @author.destroy

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_author
      @author = Author.find(params[:id])