app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("task_name", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task_name", "fghfhfg"], ["comment", "fhgdhd"], ["created_at", "2015-07-23 14:04:57.560319"], ["updated_at", "2015-07-23 14:04:57.560319"]]